r-map/ArduinoCore-avr/boards.txt
# See: http://code.google.com/p/arduino/wiki/Platforms

menu.cpu=Processor

##Microduino Core (328p)
##############################################################
328p.name= Microduino Core (328p)

328p.upload.tool=avrdude
328p.upload.protocol=arduino

328p.bootloader.tool=avrdude
328p.bootloader.unlock_bits=0x3F
328p.bootloader.lock_bits=0x0F

328p.build.board=AVR_PRO
328p.build.core=arduino
328p.build.variant=standard

## ATmega328 16M
## -------------------------------------------------
328p.menu.cpu.16MHzatmega328=Atmega328P@16M,5V

328p.menu.cpu.16MHzatmega328.upload.maximum_size=32256
328p.menu.cpu.16MHzatmega328.upload.maximum_data_size=2048
328p.menu.cpu.16MHzatmega328.upload.speed=115200

328p.menu.cpu.16MHzatmega328.bootloader.low_fuses=0xFF
328p.menu.cpu.16MHzatmega328.bootloader.high_fuses=0xDE
328p.menu.cpu.16MHzatmega328.bootloader.extended_fuses=0x05
328p.menu.cpu.16MHzatmega328.bootloader.file=optiboot/optiboot_micro_328p_16m.hex

328p.menu.cpu.16MHzatmega328.build.mcu=atmega328p
328p.menu.cpu.16MHzatmega328.build.f_cpu=16000000L

## ATmega328 8M
## --------------------------------------------------
328p.menu.cpu.8MHzatmega328=Atmega328P@8M,3.3V

328p.menu.cpu.8MHzatmega328.upload.maximum_size=32256
328p.menu.cpu.8MHzatmega328.upload.maximum_data_size=2048
328p.menu.cpu.8MHzatmega328.upload.speed=57600

328p.menu.cpu.8MHzatmega328.bootloader.low_fuses=0xFF
328p.menu.cpu.8MHzatmega328.bootloader.high_fuses=0xDE
328p.menu.cpu.8MHzatmega328.bootloader.extended_fuses=0x05
328p.menu.cpu.8MHzatmega328.bootloader.file=optiboot/optiboot_micro_328p_8m.hex

328p.menu.cpu.8MHzatmega328.build.mcu=atmega328p
328p.menu.cpu.8MHzatmega328.build.f_cpu=8000000L

##Microduino Core (168pa)
##############################################################
168p.name= Microduino Core (168pa)

168p.upload.tool=avrdude
168p.upload.protocol=arduino

168p.bootloader.tool=avrdude
168p.bootloader.unlock_bits=0x3F
168p.bootloader.lock_bits=0x0F

168p.build.board=AVR_PRO
168p.build.core=arduino
168p.build.variant=standard

## ATmega168 16M
## -------------------------------------------------
168p.menu.cpu.16MHzatmega168=Atmega168pa@16M,5V

168p.menu.cpu.16MHzatmega168.upload.maximum_size=15872
168p.menu.cpu.16MHzatmega168.upload.maximum_data_size=1024
168p.menu.cpu.16MHzatmega168.upload.speed=115200

168p.menu.cpu.16MHzatmega168.bootloader.low_fuses=0xFF
168p.menu.cpu.16MHzatmega168.bootloader.high_fuses=0xDD
168p.menu.cpu.16MHzatmega168.bootloader.extended_fuses=0x04
168p.menu.cpu.16MHzatmega168.bootloader.file=optiboot/optiboot_micro_168pa_16m.hex

168p.menu.cpu.16MHzatmega168.build.mcu=atmega168p
168p.menu.cpu.16MHzatmega168.build.f_cpu=16000000L

## ATmega168 8M
## --------------------------------------------------
168p.menu.cpu.8MHzatmega168=Atmega168pa@8M,3.3V

168p.menu.cpu.8MHzatmega168.upload.maximum_size=15872
168p.menu.cpu.8MHzatmega168.upload.maximum_data_size=1024
168p.menu.cpu.8MHzatmega168.upload.speed=57600

168p.menu.cpu.8MHzatmega168.bootloader.low_fuses=0xE2
168p.menu.cpu.8MHzatmega168.bootloader.high_fuses=0xDD
168p.menu.cpu.8MHzatmega168.bootloader.extended_fuses=0x04
168p.menu.cpu.8MHzatmega168.bootloader.file=optiboot/optiboot_micro_168pa_8m.hex

168p.menu.cpu.8MHzatmega168.build.mcu=atmega168p
168p.menu.cpu.8MHzatmega168.build.f_cpu=8000000L

##Microduino Core+ (644pa)
##############################################################
644p.name= Microduino Core+ (644pa)

644p.upload.tool=avrdude
644p.upload.protocol=arduino

644p.bootloader.tool=avrdude
644p.bootloader.unlock_bits=0x3F
644p.bootloader.lock_bits=0x0F

644p.build.board=AVR_PLUS
644p.build.core=arduino
644p.build.variant=plus

## ATmega644 16M
## -------------------------------------------------
644p.menu.cpu.16MHzatmega644=Atmega644pa@16M,5V

644p.menu.cpu.16MHzatmega644.upload.maximum_size=64512
644p.menu.cpu.16MHzatmega644.upload.maximum_data_size=4096
644p.menu.cpu.16MHzatmega644.upload.speed=115200

644p.menu.cpu.16MHzatmega644.bootloader.low_fuses=0xFF
644p.menu.cpu.16MHzatmega644.bootloader.high_fuses=0xDE
644p.menu.cpu.16MHzatmega644.bootloader.extended_fuses=0xFD
644p.menu.cpu.16MHzatmega644.bootloader.file=optiboot/optiboot_micro_644pa_16m.hex

644p.menu.cpu.16MHzatmega644.build.mcu=atmega644p
644p.menu.cpu.16MHzatmega644.build.f_cpu=16000000L

## ATmega644 8M
## --------------------------------------------------
644p.menu.cpu.8MHzatmega644=Atmega644pa@8M,3.3V

644p.menu.cpu.8MHzatmega644.upload.maximum_size=64512
644p.menu.cpu.8MHzatmega644.upload.maximum_data_size=4096
644p.menu.cpu.8MHzatmega644.upload.speed=57600

644p.menu.cpu.8MHzatmega644.bootloader.low_fuses=0xFF
644p.menu.cpu.8MHzatmega644.bootloader.high_fuses=0xDE
644p.menu.cpu.8MHzatmega644.bootloader.extended_fuses=0xFD
644p.menu.cpu.8MHzatmega644.bootloader.file=optiboot/optiboot_micro_644pa_8m.hex

644p.menu.cpu.8MHzatmega644.build.mcu=atmega644p
644p.menu.cpu.8MHzatmega644.build.f_cpu=8000000L

##Microduino Core+ (1284pa)
##############################################################
1284p.name= Microduino Core+ (1284pa)

1284p.upload.tool=avrdude
1284p.upload.protocol=arduino

1284p.bootloader.tool=avrdude
1284p.bootloader.unlock_bits=0x3F
1284p.bootloader.lock_bits=0x0F

1284p.build.board=AVR_PLUS
1284p.build.core=arduino
1284p.build.variant=plus

## ATmega1284 16M
## -------------------------------------------------
1284p.menu.cpu.16MHzatmega1284=Atmega1284pa@16M,5V

1284p.menu.cpu.16MHzatmega1284.upload.maximum_size=130048
1284p.menu.cpu.16MHzatmega1284.upload.maximum_data_size=16384
1284p.menu.cpu.16MHzatmega1284.upload.speed=115200

1284p.menu.cpu.16MHzatmega1284.bootloader.low_fuses=0xFF
1284p.menu.cpu.16MHzatmega1284.bootloader.high_fuses=0xDE
1284p.menu.cpu.16MHzatmega1284.bootloader.extended_fuses=0xFD
1284p.menu.cpu.16MHzatmega1284.bootloader.file=optiboot/optiboot_micro_1284_16m.hex

1284p.menu.cpu.16MHzatmega1284.build.mcu=atmega1284p
1284p.menu.cpu.16MHzatmega1284.build.f_cpu=16000000L

## ATmega1284 8M
## --------------------------------------------------
1284p.menu.cpu.8MHzatmega1284=Atmega1284pa@8M,3.3V

1284p.menu.cpu.8MHzatmega1284.upload.maximum_size=130048
1284p.menu.cpu.8MHzatmega1284.upload.maximum_data_size=16384
1284p.menu.cpu.8MHzatmega1284.upload.speed=57600

